Repository: BozoDel/LoveKnowsNoBorders-PT
Catalog: lovePT-level2.tmx
Source language: en_us
Languages: pt_br

source: Draw an image (the [https://love2d.org/w/images/c/c3/Resource-HamsterBall.png Hamster Ball]) from the center at 100 by 100 pixels, rotated by 90 degrees
pt_br: Desenhar uma imagem (a [https://love2d.org/w/images/c/c3/Resource-HamsterBall.png Bola de Hamster]) a partir do centro, na posição 100 por 100 pixels, girado em 90 graus

source: love.graphics.draw( image, quad, x, y, r, sx, sy, ox, oy, kx, ky )
pt_br: love.graphics.draw( imagem, quad, x, y, r, ex, ey, ox, oy, ix, iy )

source: The current point size.
pt_br: O tamanho de ponto atual.

source: * [[love.graphics.setPointStyle]]
pt_br: * [[love.graphics.setPointStyle (Português)|love.graphics.setPointStyle]]

source: function love.load() love.graphics.setBackgroundColor(54, 172, 248) end function love.draw() love.graphics.setBlendMode("alpha") --Default blend mode love.graphics.setColor(230, 44, 123) love.graphics.rectangle("fill", 50, 50, 100, 100) love.graphics.setColor(12, 100, 230) love.graphics.setBlendMode("multiplicative") love.graphics.rectangle("fill", 75, 75, 125, 125) end
pt_br: function love.load() love.graphics.setBackgroundColor(54, 172, 248) end function love.draw() love.graphics.setBlendMode("alpha") --Modo de mistura padrão love.graphics.setColor(230, 44, 123) love.graphics.rectangle("fill", 50, 50, 100, 100) love.graphics.setColor(12, 100, 230) love.graphics.setBlendMode("multiplicative") love.graphics.rectangle("fill", 75, 75, 125, 125) end

source: Resets the current coordinate transformation.
pt_br: Reinicia a transformação de coordenadas atual.

source: success = love.filesystem.unmount( archive )
pt_br: sucesso = love.filesystem.unmount( arquivo )

source: FileDecoder
pt_br: DecodificadorDeArquivo

source: kx
pt_br: ix

source: isSupported = love.graphics.isSupported( support1, support2, support3, ... )
pt_br: ehSuportado = love.graphics.isSupported( suporte1, suporte2, suporte3, ... )

source: font = love.graphics.newFont( filename, size )
pt_br: fonte = love.graphics.newFont( nomeDoArquivo, tamanho )

source: An [[Image]] or [[Canvas]] to texture the Quad with.
pt_br: Uma [[Image (Português)|Imagem]] ou [[Canvas (Português)|Pintura]] para texturizar o Quad.

source: Load a sound effect and play it
pt_br: Carregar e tocar um efeito sonoro

source: Gets the line join style.
pt_br: Obtém o estilo de junção de linha.

source: image
pt_br: imagem

source: For example, if red is set to false , no further changes will be made to the red component of any pixels.
pt_br: Por exemplo, se vermelho estiver configurado como falso , não será feita mais nenhuma mudança no componente vermelho de qualquer pixel.

source: Whether the identity directory will be searched when reading a filepath before or after the game's source directory and any archives currently mounted with [[love.filesystem.mount]].
pt_br: Se o diretório identidade será buscado ao ler um caminho de arquivo antes ou depois do diretório fonte do jogo e de quaisquer arquivos atualmente montados com [[love.filesystem.mount (Português)|love.filesystem]].

source: Drawing a rectangle using a pixel effect shader
pt_br: Desenhar um retângulo usado um shader de efeito de pixel

source: A new framebuffer with specified width and height.
pt_br: Um novo framebuffer com largura e altura especificadas.

source: A File pointing to a font.
pt_br: Um Arquivo apontando para uma fonte.

source: Toggle between [[love.graphics.setPoint|point styles]] with the help of [[love.graphics.setPointStyle]].
pt_br: Alternar entre [[love.graphics.setPoint (Português)|estilos de ponto]] com a ajuda de [[love.graphics.setPointStyle (Português)|love.graphics.setPointStyle]].

source: The name of the graphics card vendor, e.g. "Intel Inc."
pt_br: O nome do fornecedor da placa de vídeo, por exemplo "Intel Inc."

source: Whether the archive will be searched when reading a filepath before or after already-mounted archives. This includes the game's source and save directories.
pt_br: Se o arquivo será buscado ao ler um caminho de arquivo antes ou depois de outros arquivos já montados. Isso inclui a fonte do jogo e o diretório de escrita.

source: Each game is granted a single directory on the system where files can be saved through love.filesystem.
pt_br: A cada jogo é concedido um único diretório no sistema onde arquivos podem ser salvos, por meio do love.filesystem.

source: This is demonstrated by drawing a rectangle that shows the rotation and a point that is right in the center and thus does not move when the scene rotates.
pt_br: Isso é demonstrado através do desenho de um retângulo em rotação, e um ponto, que é o centro e não se move enquanto a cena é rotacionada.

source: The game will also be able to load C Lua dynamic libraries which are located in the save directory.
pt_br: O jogo também será capaz de carregar bibliotecas dinâmicas C Lua localizadas no diretório de escrita.

source: True if there is a directory with the specified name. False otherwise.
pt_br: Verdadeiro se houver um diretório com o nome especificado. Senão, falso.

source: Draw a polygon.
pt_br: Desenha um polígono.

source: Functions
pt_br: Funções

source: love.graphics.drawq( image, quad, x, y, r, sx, sy, ox, oy, kx, ky )
pt_br: love.graphics.drawq( imagem, quad, x, y, r, ex, ey, ox, oy, ix, iy )

source: The file contents
pt_br: O conteúdo do arquivo

source: Pixel shader code must contain at least one function, named effect , which is the function that will produce the color which is blended onto the screen for each pixel a drawn object touches.
pt_br: O código de shaders de pixel deve conter pelo menos uma função, chamada effect (efeito), que é a função que vai produzir a cor misturada na tela para cada pixel tocado por um objeto desenhado na tela.

source: points
pt_br: pontos

source: font = love.graphics.getFont( )
pt_br: fonte = love.graphics.getFont( )

source: Font
pt_br: Fonte

source: The reference width, the width of the [[Image]]. (Must be greater than 0.)
pt_br: A largura de referência, a largura da [[Image (Português)|Imagem]]. (Tem que ser maior que 0.)

source: Sets the position of the listener, which determines how sounds play.
pt_br: Configura a posição do ouvinte, o que determina como os sons irão tocar.

source: Drawing circles masked by a rectangle
pt_br: Desenhar círculos mascarados por um retângulo

source: The specified [[Framebuffer]] will be cleared.
pt_br: O [[Framebuffer (Português)|Framebuffer]] especificado será limpo.

source: Returns the application data directory (could be the same as getUserDirectory)
pt_br: Retorna diretório de dados do aplicativo (pode ser igual getUserDirectory).

source: * [[love.filesystem.unmount]]
pt_br: * [[love.filesystem.unmount (Português)|love.filesystem.unmount]]

source: Scaling lasts until love.draw() exits.
pt_br: O redimensionamento dura até a saída da função love.draw().

source: It stores the current coordinate transformation state into the transformation stack and keeps it active.
pt_br: Ela salva o estado de transformação de coordenadas atual na pilha de transformações e o mantém ativo.

source: The size of the font.
pt_br: O tamanho da fonte.

source: A File pointing to an audio file.
pt_br: Um Arquivo apontando para um arquivo de áudio.

source: Append data to an existing file.
pt_br: Acrescentar dados a um arquivo existente.

source: Scaling by a negative value flips the coordinate system in the corresponding direction, which also means everything will be drawn flipped or upside down, or both.
pt_br: Redimensionar de acordo com um valor negativo vira o sistema de coordenadas na direção correspondente, o que significa que tudo será desenhado virado ou de ponta cabeça, ou ambos.

source: * [[love.graphics.setDefaultFilter]]
pt_br: * [[love.graphics.setDefaultFilter (Português)|love.graphics.setDefaultFilter]]

source: So to get clean pixels drawn use 0.5 + integer increments.
pt_br: Então, para desenhar pixels limpos, use 0.5 + incrementos em números inteiros.

source: drawable
pt_br: desenhavel

source: love.graphics.triangle( mode, x1, y1, x2, y2, x3, y3 )
pt_br: love.graphics.triangle( modo, x1, y1, x2, y2, x3, y3 )

source: Scale factor (y-axis).
pt_br: Fator de escala (eixo y).

source: Sets the [[love.graphics.setPoint|point]] style.
pt_br: Configura o estilo de [[love.graphics.setPoint (Português)|ponto]].

source: The position of the center along y-axis.
pt_br: A posição do centro ao longo do eixo y.

source: This function is not supported in earlier versions
pt_br: Esta função não é suportada em versões anteriores

source: min
pt_br: red

source: An ImageData object. The Image will use this ImageData to reload itself when [[love.window.setMode]] is called.
pt_br: Um objeto DadoDeImagem. A imagem usará este DadoDeImagem para se recarregar quando [[love.window.setMode (Português)| love.window.setMode]] for chamada.

source: Enables all color components.
pt_br: Ativa todos componentes de cor.

source: This function is called automatically before [[love.draw]] in the default [[love.run]] function.
pt_br: Esta função é chamada automaticamente antes de [[love.draw (Português)|love.draw]] na função [[love.run (Português)|love.run]] padrão.

source: path = love.filesystem.getUserDirectory( )
pt_br: caminho = love.filesystem.getUserDirectory( )

source: table
pt_br: tabela

source: DrawMode
pt_br: ModoDeDesenho

source: A string of the characters in the image in order from left to right.
pt_br: Um string dos caracteres na imagem, na ordem da esquerda para a direita.

source: You can visualise the pattern by reading the binary sequence backwards.
pt_br: É possível visualizar o padrão lendo a sequência binária de trás para frente.

source: function love.draw() love.graphics.translate(10, 10) love.graphics.print("Text", 5, 5) -- will effectively render at 15x15 end
pt_br: function love.draw() love.graphics.translate(10, 10) love.graphics.print("Texto", 5, 5) -- na verdade, será renderizado em 15x15 end

source: The same goes for other operations that involve writing to the filesystem, like mkdir.
pt_br: O mesmo vale para outras operações que envolvam a escrita no sistema de arquivos, como o mkdir.

source: screenshot
pt_br: captura

source: The source on which to pause the playback
pt_br: A fonte que se deseja pausar.

source: love.graphics.setPointStyle( style )
pt_br: love.graphics.setPointStyle( estilo )

source: * [[ love.graphics.newStencil]]
pt_br: * [[ love.graphics.newStencil (Português)|love.graphics.newStencil]]

source: The Y velocity of the listener.
pt_br: A velocidade em Y do ouvinte.

source: LÖVE shader language
pt_br: Linguagem de shader do LÖVE

source: font = love.graphics.setNewFont( rasterizer )
pt_br: fonte = love.graphics.setNewFont( rasterizador )

source: love.audio.stop( source )
pt_br: love.audio.stop( fonte )

source: Image contents do not directly affect the stencil, but see below for a workaround.
pt_br: O conteúdo das imagens não afeta diretamente o estêncil, mas veja abaixo uma maneira de contornar isso.

source: function love.keypressed(k) if k == 'escape' then love.event.push('q') -- Quit the game. end end
pt_br: function love.keypressed(k) if k == 'escape' then love.event.push('q') -- Sai do jogo. end end

source: success = love.filesystem.write( name, data, size )
pt_br: sucesso = love.filesystem.write( nome, dado, tamanho )

source: The character code of the glyph.
pt_br: O código de caracter do glifo.

source: Pixel effects are not programmed in Lua, but by using a special effect language instead.
pt_br: Efeitos de pixel não são programados em Lua, e sim em uma linguagem de efeitos especial.

source: The Source to play.
pt_br: A fonte a ser tocada.

source: Later changes to the transformation can be undone by using the pop operation, which returns the coordinate transform to the state it was in before calling push.
pt_br: Mudanças posteriores à transformação podem ser desfeitas usando a operação de desempilhamento, que retorna a transformação de coordenadas ao estado em que estava antes de se chamar o empilhamento.

source: A new Source that can play the specified audio.
pt_br: Uma nova Fonte que pode tocar o áudio especificado.

source: Routes drawing operations through a shader.
pt_br: Passa operações de desenho por um shader.

source: The new File object.
pt_br: O novo objeto Arquivo.

source: Draws a quadrilateral shape.
pt_br: Desenha um quadrilátero.

source: The shear factor on the y-axis.
pt_br: O fator de inclinação do eixo y.

source: How many bytes to write.
pt_br: Quantidade de bytes a ser escrita.

source: A rasterizer.
pt_br: Um rasterizador.

source: love.audio.resume( source )
pt_br: love.audio.resume( fonte )

source: Displays the results of drawing operations on the screen.
pt_br: Mostra os resultados de operações de desenho na tela.

source: The contents of the file.
pt_br: O conteúdo do arquivo.

source: This function is always used to prepare for a corresponding [[love.graphics.pop|pop]] operation later.
pt_br: Esta função é sempre usada para preparar uma operação de [[love.graphics.pop (Português)|desempilhamento]] posterior correspondente.

source: The number of segments used for drawing the arc.
pt_br: O número de segmentos usados para desenhar o arco.

source: You'll also need a proper [[Font]] for special characters.
pt_br: Você também vai precisar de uma [[Font (Português)|Fonte]] apropriada para caracteres especiais.

source: The position of the bottom left corner along y-axis.
pt_br: A posição do canto inferior esquerdo no eixo y.

source: * [[ File]]
pt_br: * [[ File (Português)|Arquivo]]

source: Such functions can be invoked as usual, via [[love.event.push]] using the table index as an argument.
pt_br: Essas funções podem ser invocadas normalmente, com [[love.event.push (Português)|love.event.push]], usando o índice da tabela como argumento.

source: An amazing circle.
pt_br: Um círculo maravilhoso.

source: LineStyle
pt_br: EstiloDeLinha

source: It has been renamed to [[love.graphics.newCanvas]]
pt_br: Foi renomeado para [[love.graphics.newCanvas (Português)|love.graphics.newCanvas]]

source: Built-in variables
pt_br: Variáveis embutidas

source: * [[ GlyphData]]
pt_br: * [[ GlyphData (Português)|DadoDeGlifo]]

source: SpriteBatchUsage
pt_br: UsoDeLoteDeSprites

source: Check whether a file or directory exists.
pt_br: Verifica se um arquivo ou diretório existe.

source: Sets the render target to a specified [[Canvas]].
pt_br: Configura a [[Canvas (Português)|Pintura]] especificada como alvo da renderização.

source: Sets the orientation of the listener.
pt_br: Configura a orientação do ouvinte.

source: Pump events into the event queue.
pt_br: Adiciona eventos à fila de eventos.

source: Creates a new [[FileData]] from a file on the hard drive.
pt_br: Cria um novo [[FileData (Português)|DadoDeArquivo]] a partir de um arquivo no disco rígido.

source: The Image object to create the font from.
pt_br: O objeto Imagem com qual a fonte será criada.

source: assert(love.graphics.isSupported("canvas"), "Your graphics card does not support canvases, sorry!")
pt_br: assert(love.graphics.isSupported("canvas"), "Perdão, mas a sua placa de vídeo não suporta pinturas!")

source: font = love.graphics.newImageFont( image, glyphs )
pt_br: fonte = love.graphics.newImageFont( imagem, glifos )

source: * [[love.filesystem.exists]]
pt_br: * [[love.filesystem.exists (Português)|love.filesystem.exists]]

source: How to draw the circle.
pt_br: Como desenhar o círculo.

source: A function which is called for each file and folder in the directory. The filename is passed to the function as an argument.
pt_br: Uma função que é chamada para cada arquivo e pasta no diretório. O nome do arquivo é passado à função como um argumento.

source: This change lasts until [[love.draw]]() exits or else a [[love.graphics.pop]] reverts to a previous [[love.graphics.push]].
pt_br: Essa mudança dura até a saída de [[love.draw (Português)|love.draw]] ou então até que um [[love.graphics.pop (Português)|love.graphics.pop]] restabeleça um [[love.graphics.push (Português)|love.graphics.push]] anterior.

source: The primary responsibility for the love.graphics module is the drawing of lines, shapes, text, [[Image]]s and other [[Drawable]] objects onto the screen.
pt_br: A responsabilidade primária do módulo love.graphics é desenhar linhas, formas, texto, [[Image (Português)|Imagens]] e outros objetos do tipo [[Drawable (Português)|Desenhável]] na tela.

source: love.graphics.printf( text, x, y, limit, align, r, sx, sy, ox, oy, kx, ky )
pt_br: love.graphics.printf( texto, x, y, limite, alinhamento, r, ex, ey, ox, oy, ix, iy )

source: Types
pt_br: Tipos

source: FileData
pt_br: DadoDeArquivo

source: * [[Shader]]
pt_br: * [[Shader (Português)|Shader]]

source: Initializes love.filesystem, will be called internally, so should not be used explicitly.
pt_br: Inicializa o módulo love.filesystem, será chamada internamente, por isso não deve ser chamada explicitamente.

source: The new shader.
pt_br: O novo shader.

source: A function that iterates over all the lines in the file
pt_br: Uma função que itera por todas as linhas do arquivo.

source: boolean
pt_br: booleano

source: is_file
pt_br: eh_arquivo

source: The z position of the listener.
pt_br: A posição em z do ouvinte.

source: myStencilFunction = function() love.graphics.rectangle("fill", 225, 200, 350, 300) end love.graphics.setStencil(myStencilFunction) love.graphics.setColor(255, 0, 0, 120) love.graphics.circle("fill", 300, 300, 150, 50) love.graphics.setColor(0, 255, 0, 120) love.graphics.circle("fill", 500, 300, 150, 50) love.graphics.setColor(0, 0, 255, 120) love.graphics.circle("fill", 400, 400, 150, 50)
pt_br: minhaFuncaoEstencil = function() love.graphics.rectangle("fill", 225, 200, 350, 300) end love.graphics.setStencil(minhaFuncaoEstencil) love.graphics.setColor(255, 0, 0, 120) love.graphics.circle("fill", 300, 300, 150, 50) love.graphics.setColor(0, 255, 0, 120) love.graphics.circle("fill", 500, 300, 150, 50) love.graphics.setColor(0, 0, 255, 120) love.graphics.circle("fill", 400, 400, 150, 50)

source: glyph
pt_br: glifo

source: The position of second point on the y-axis.
pt_br: A posição do segundo ponto no eixo y.

source: This module provides access to files in two places, and two places only:
pt_br: Este módulo provê acesso aos arquivos em dois e somente dois lugares:

source: Resets the render target to the screen, i.e.
pt_br: Reconfigura a tela como alvo da renderização, isso é,

source: pixelcode
pt_br: codigodepixel

source: The filepath to the font.
pt_br: O caminho de arquivo da fonte.

source: love.graphics.setCanvas( canvas )
pt_br: love.graphics.setCanvas( pintura )

source: The origin is by default located at the top left corner of [[Image]] and [[Canvas]].
pt_br: Por padrão, a origem se encontra no canto superior esquerdo da [[Image (Português)|Imagem]] e da [[Canvas (Português)|Pintura]].

source: decoder
pt_br: decodificador

source: Gets the current target [[Canvas]].
pt_br: Obtém a [[Canvas (Português)|Pintura]] alvo atual.

source: The new render target.
pt_br: O novo alvo de renderização.

source: It has been renamed from [[love.filesystem.mkdir]]
pt_br: Foi renomeado, antes era [[love.filesystem.mkdir (Português)|love.filesystem.mkdir]]

source: True if wireframe lines are used when drawing, false if it's not.
pt_br: Verdadeiro se linhas de estrutura de arame estão sendo usadas ao desenhar, senão, falso.

source: type ("stream")
pt_br: tipo ("stream")

source: A numerical indexed table with the red, green, blue and alpha values as [[number]]s. The alpha is optional and defaults to 255 if it is left out.
pt_br: Uma tabela com índice numérico com os valores de vermelho, verde, azul e alfa como [[number (Português)|números]]. O alfa é opcional e seu valor padrão será 255 se não for indicado.

source: If multiple canvases are being rendered to simultaneously (by giving multiple Canvas parameters to [[love.graphics.setCanvas]]), you can use the effects function instead of effect in order to output a separate color to each Canvas.
pt_br: Se está sendo feita renderização em pinturas múltiplas simultaneamente (dando-se múltiplos parâmetros Pintura para [[love.graphics.setCanvas (Português)|love.graphics.setCanvas]], você pode usar a função effects (efeitos) em vez de effect (efeito) para produzir uma cor separada para cada Pintura.

source: Pops the current coordinate transformation from the transformation stack.
pt_br: Desempilha a transformação de coordenadas atual da pilha de transformações.

source: Captures drawing operations to a [[Canvas]]
pt_br: Captura operações de desenho em uma [[Canvas (Português)|Pintura]]

source: -- a black/white mask image: black pixels will mask, white pixels will pass. local mask = love.graphics.newImage("mymask.png") local mask_effect = love.graphics.newPixelEffect [[ vec4 effect ( vec4 color, Image texture, vec2 texture_coords, vec2 screen_coords ) { // a discarded fragment will fail the stencil test. if (Texel(texture, texture_coords).rgb == vec3(0.0)) discard; return vec4(1.0); } ]] myStencilFunction = function () love.graphics.setPixelEffect(mask_effect) love.graphics.draw(mask, 0, 0) love.graphics.setPixelEffect() end love.graphics.setStencil(myStencilFunction) love.graphics.rectangle("fill", 0, 0, 256, 256)
pt_br: -- uma imagem máscara em preto e branco: pixels pretos mascaram, pixels brancos passam. local mascara = love.graphics.newImage("minhamascara.png") local efeito_mascara = love.graphics.newPixelEffect [[ vec4 effect ( vec4 color, Image texture, vec2 texture_coords, vec2 screen_coords ) { // um fragmento descartado falhará no teste do estêncil. if (Texel(texture, texture_coords).rgb == vec3(0.0)) discard; return vec4(1.0); } ]] minhaFuncaoEstencil = function () love.graphics.setPixelEffect(efeito_mascara) love.graphics.draw(mascara, 0, 0) love.graphics.setPixelEffect() end love.graphics.setStencil(minhaFuncaoEstencil) love.graphics.rectangle("fill", 0, 0, 256, 256)

source: Load background music and play it
pt_br: Carregar e tocar música de fundo

source: The identity that is used as write directory.
pt_br: A identidade que é usada como diretório de escrita.

source: Returns the path of the user's directory
pt_br: Retorna o caminho do diretório do usuário

source: Gets the max supported point size.
pt_br: Obtém o tamanho máximo de ponto suportado.

source: * [[Source:setPosition]]
pt_br: * [[Source:setPosition (Português)|Source:setPosition]]

source: Combine the above example into one string or file with the help of #ifdef .
pt_br: Combinar o exemplo acima em um único string ou arquivo com a ajuda de #ifdef .

source: font = love.graphics.newImageFont( filename, glyphs )
pt_br: fonte = love.graphics.newImageFont( nomeDoArquivo, glifos )

source: Resets the current graphics settings.
pt_br: Reinicia as configurações gráficas atuais.

source: Sets the line join style.
pt_br: Configura o estilo de junção de linha.

source: It has been renamed to [[love.graphics.getDefaultFilter]]
pt_br: Foi renomeado para [[love.graphics.getDefaultFilter (Português)|love.graphics.getDefaultFilter]]

source: function love.draw() love.graphics.push() -- stores the default coordinate system love.graphics.translate(...) -- move the camera position love.graphics.scale(...) -- zoom the camera -- use the new coordinate system to draw the viewed scene love.graphics.pop() -- return to the default coordinates -- draw the status display using the screen coordinates end
pt_br: function love.draw() love.graphics.push() -- salva o sistema de coordenadas padrão love.graphics.translate(...) -- move a posição da câmera love.graphics.scale(...) -- dá zoom com a câmera -- usar o novo sistema de coordenadas para desenhar a cena love.graphics.pop() -- retorna às coordenadas padrão -- desenhar o monitor de status usando as coordenadas da tela end
